In [1]:
import pandas as pd
import cvxpy as cp
import numpy as np
from numpy import random

# File path will be different on another device and must be replaced with the correct file path.
students = pd.read_csv("Sample Data (for scheduling) - Students.csv")
print(students.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Student ID       60 non-null     int64
 1   First Name       60 non-null     object
 2   Last Name        60 non-null     object
 3   Gender           60 non-null     object
 4   Age              60 non-null     int64
 5   Times Available  60 non-null     object
dtypes: int64(2), object(4)
memory usage: 2.9+ KB
None

In [2]:
teachers = pd.read_csv("Sample Data (for scheduling) - Teachers.csv")
print(teachers.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Teacher ID    14 non-null     int64
 1   Class         14 non-null     object
 2   Availability  14 non-null     object
dtypes: int64(1), object(2)
memory usage: 464.0+ bytes
None

In [3]:
students['Age'].value_counts()

Age
9     13
12    12
11    11
13     9
8      8
10     7
Name: count, dtype: int64

In [4]:
# Reference: https://www.geeksforgeeks.org/create-a-new-column-in-pandas-dataframe-based-on-the-existing-columns/
def grade(age):
    if age > 11:
        return "elem"
    else:
        return "ms"

students['Grade'] = students['Age'].map(grade)
display(students.head())

   Student ID First Name Last Name Gender  Age Times Available Grade
0           0     Ximeno   Colombo      M    9    [1, 2, 3, 4]    ms
1           1   Dorothea   Clayton      F    9       [1, 3, 4]    ms
2           2   Beibhinn       Nye      F   13       [1, 2, 3]  elem
3           3      Oskar   Ciobanu      M   12    [1, 2, 3, 4]  elem
4           4    Matilda   Solomon      F   11          [2, 3]    ms

In [5]:
students['Grade'].value_counts()

Grade
ms      39
elem    21
Name: count, dtype: int64

In [6]:
firstHour = []
secondHour = []
thirdHour = []
fourthHour = []

for i in students['Times Available']:
    x = []
    for j in i:
        if j.isdigit(): # Reference: https://www.w3schools.com/python/ref_string_isdigit.asp
            x.append(int(j))
    if 1 in x:
        firstHour.append(1)
    else:
        firstHour.append(0)
    if 2 in x:
        secondHour.append(1)
    else:
        secondHour.append(0)
    if 3 in x:
        thirdHour.append(1)
    else:
        thirdHour.append(0)
    if 4 in x:
        fourthHour.append(1)
    else:
        fourthHour.append(0)

In [7]:
# Reference: https://www.geeksforgeeks.org/add-multiple-columns-to-dataframe-in-pandas/
students['First Hour'] = firstHour
students['Second Hour'] = secondHour
students['Third Hour'] = thirdHour
students['Fourth Hour'] = fourthHour

In [8]:
display(students.head())

,Student ID,First Name,Last Name,Gender,Age,Times Available,Grade,First Hour,Second Hour,Third Hour,Fourth Hour
0,0,Ximeno,Colombo,M,9,"[1, 2, 3, 4]",ms,1,1,1,1
1,1,Dorothea,Clayton,F,9,"[1, 3, 4]",ms,1,0,1,1
2,2,Beibhinn,Nye,F,13,"[1, 2, 3]",elem,1,1,1,0
3,3,Oskar,Ciobanu,M,12,"[1, 2, 3, 4]",elem,1,1,1,1
4,4,Matilda,Solomon,F,11,"[2, 3]",ms,0,1,1,0

In [9]:
# Reference: https://www.statology.org/pandas-sum-column-with-condition/
print("Number of elementary students who can attend first hour:", students.loc[students['Grade'] == "elem", 'First Hour'].sum())
print("Number of middle school students who can attend first hour:", students.loc[students['Grade'] == "ms", 'First Hour'].sum())

print("\nNumber of elementary students who can attend first hour:", students.loc[students['Grade'] == "elem", 'Second Hour'].sum())
print("Number of middle school students who can attend first hour:", students.loc[students['Grade'] == "ms", 'Second Hour'].sum())

print("\nNumber of elementary students who can attend first hour:", students.loc[students['Grade'] == "elem", 'Third Hour'].sum())
print("Number of middle school students who can attend first hour:", students.loc[students['Grade'] == "ms", 'Third Hour'].sum())

print("\nNumber of elementary students who can attend first hour:", students.loc[students['Grade'] == "elem", 'Fourth Hour'].sum())
print("Number of middle school students who can attend first hour:", students.loc[students['Grade'] == "ms", 'Fourth Hour'].sum())

Number of elementary students who can attend first hour: 17
Number of middle school students who can attend first hour: 25

Number of elementary students who can attend first hour: 12
Number of middle school students who can attend first hour: 18

Number of elementary students who can attend first hour: 11
Number of middle school students who can attend first hour: 26

Number of elementary students who can attend first hour: 13
Number of middle school students who can attend first hour: 23

In [10]:
firstHour = []
secondHour = []
thirdHour = []
fourthHour = []

for i in teachers['Availability']:
    x = []
    for j in i:
        if j.isdigit(): # Reference: https://www.w3schools.com/python/ref_string_isdigit.asp
            x.append(int(j))
    if 1 in x:
        firstHour.append(1)
    else:
        firstHour.append(0)
    if 2 in x:
        secondHour.append(1)
    else:
        secondHour.append(0)
    if 3 in x:
        thirdHour.append(1)
    else:
        thirdHour.append(0)
    if 4 in x:
        fourthHour.append(1)
    else:
        fourthHour.append(0)

In [11]:
# Reference: https://www.geeksforgeeks.org/add-multiple-columns-to-dataframe-in-pandas/
teachers['First Hour'] = firstHour
teachers['Second Hour'] = secondHour
teachers['Third Hour'] = thirdHour
teachers['Fourth Hour'] = fourthHour
display(teachers.head())

,Teacher ID,Class,Availability,First Hour,Second Hour,Third Hour,Fourth Hour
0,0,ms,"[1, 2, 3, 4]",1,1,1,1
1,1,elem,"[1, 3, 4]",1,0,1,1
2,2,elem,"[1, 2, 3, 4]",1,1,1,1
3,3,ms,"[1, 2, 3, 4]",1,1,1,1
4,4,elem,"[1, 2, 3, 4]",1,1,1,1

In [12]:
random.seed(3230)
trouble = random.choice([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], size=len(students)) # Reference: https://www.w3schools.com/python/numpy/numpy_random.asp
students['Trouble'] = trouble # Reference: https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/

teachers['Relief'] = random.choice([5, 6, 7, 8, 9, 10], size=len(teachers))

In [13]:
display(students.head())

,Student ID,First Name,Last Name,Gender,Age,Times Available,Grade,First Hour,Second Hour,Third Hour,Fourth Hour,Trouble
0,0,Ximeno,Colombo,M,9,"[1, 2, 3, 4]",ms,1,1,1,1,10
1,1,Dorothea,Clayton,F,9,"[1, 3, 4]",ms,1,0,1,1,10
2,2,Beibhinn,Nye,F,13,"[1, 2, 3]",elem,1,1,1,0,7
3,3,Oskar,Ciobanu,M,12,"[1, 2, 3, 4]",elem,1,1,1,1,6
4,4,Matilda,Solomon,F,11,"[2, 3]",ms,0,1,1,0,7

In [14]:
display(teachers.head())

,Teacher ID,Class,Availability,First Hour,Second Hour,Third Hour,Fourth Hour,Relief
0,0,ms,"[1, 2, 3, 4]",1,1,1,1,6
1,1,elem,"[1, 3, 4]",1,0,1,1,10
2,2,elem,"[1, 2, 3, 4]",1,1,1,1,5
3,3,ms,"[1, 2, 3, 4]",1,1,1,1,6
4,4,elem,"[1, 2, 3, 4]",1,1,1,1,10

In [15]:
# Reference: https://www.geeksforgeeks.org/split-pandas-dataframe-by-column-value/
elementary = students[students['Grade'] == "elem"]
middle = students[students['Grade'] == "ms"]
# Reference: https://www.geeksforgeeks.org/python-delete-rows-columns-from-dataframe-using-pandas-drop/
elementary = elementary.drop(['First Name', 'Last Name', 'Gender', 'Age', 'Times Available', 'Grade'], axis = 1)
middle = middle.drop(['First Name', 'Last Name', 'Gender', 'Age', 'Times Available', 'Grade'], axis = 1)

In [16]:
display(elementary.head())

    Student ID  First Hour  Second Hour  Third Hour  Fourth Hour  Trouble
2            2           1            1           1            0        7
3            3           1            1           1            1        6
6            6           1            1           0            1        9
7            7           1            1           1            0        8
10          10           1            1           1            1        5

In [17]:
display(middle.head())

   Student ID  First Hour  Second Hour  Third Hour  Fourth Hour  Trouble
0           0           1            1           1            1       10
1           1           1            0           1            1       10
4           4           0            1           1            0        7
5           5           1            0           0            0        1
8           8           0            0           0            1        4

In [18]:
elemTeach = teachers[teachers['Class'] == "elem"]
elemTeach = elemTeach.drop(['Class', 'Availability'], axis = 1)

msTeach = teachers[teachers['Class'] == "ms"]
msTeach = msTeach.drop(['Class', 'Availability'], axis = 1)

In [19]:
display(elemTeach.head())

    Teacher ID  First Hour  Second Hour  Third Hour  Fourth Hour  Relief
1            1           1            0           1            1      10
2            2           1            1           1            1       5
4            4           1            1           1            1      10
8            8           1            1           0            1      10
11          11           1            1           0            1       9

In [20]:
display(msTeach.head())

   Teacher ID  First Hour  Second Hour  Third Hour  Fourth Hour  Relief
0           0           1            1           1            1       6
3           3           1            1           1            1       6
5           5           1            1           1            0       8
6           6           1            0           1            1       7
7           7           0            1           0            1       9

In [21]:
# TODO: Formulation will be placed here.
e = cp.Variable((4, len(elementary)), boolean = True)
m = cp.Variable((4, len(middle)), boolean = True)
# See https://github.com/samdavanloo/ISE-3230/blob/master/codes_in_CVXpy.ipynb as a reference to figure out how to add the np.arrays.